xtee6/center-service/test/resources/client_reg_request_CONTROLLERTEST_WRONG_INSTANCE.soap

<?xml version="1.0" encoding="utf-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:id="http://x-road.eu/xsd/identifiers" xmlns:xroad="http://x-road.eu/xsd/xroad.xsd">
  <SOAP-ENV:Header>
    <xroad:client id:objectType="MEMBER">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>GOV</id:memberClass>
      <id:memberCode>codeOfMember</id:memberCode>
      <id:subsystemCode>codeOfSubsystem</id:subsystemCode>
    </xroad:client>
    <xroad:service id:objectType="SERVICE">
      <id:xRoadInstance>EE</id:xRoadInstance>
      <id:memberClass>GOV</id:memberClass>
      <id:memberCode>managementServiceCode</id:memberCode>
      <id:subsystemCode>managementServiceSubsystemCode</id:subsystemCode>
      <id:serviceCode>clientReg</id:serviceCode>
    </xroad:service>
    <xroad:userId>proxyUi</xroad:userId>
    <xroad:id>9b2fa334-c227-4439-8a80-e22c87317196</xroad:id>
    <xroad:async>false</xroad:async>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <xroad:clientReg>
      <xroad:server id:objectType="SERVER">
        <id:xRoadInstance>EE</id:xRoadInstance>
        <id:memberClass>GOV</id:memberClass>
        <id:memberCode>codeOfMember</id:memberCode>
        <id:serverCode>serverCode</id:serverCode>
      </xroad:server>
      <xroad:client id:objectType="SUBSYSTEM">
        <id:xRoadInstance>XAXACA</id:xRoadInstance>
        <id:memberClass>GOV</id:memberClass>
        <id:memberCode>codeOfMember</id:memberCode>
        <id:subsystemCode>codeOfSubsystem</id:subsystemCode>
      </xroad:client>
    </xroad:clientReg>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
